In [1]:
import pandas as pd
df=pd.read_csv("sample.csv")
df

      Name  Age  Salary
0      jyo   16  10,000
1    jyosh   25  20,000
2  jyotsna   20  35,000
3    priya   21  25,000
4    satya   18  20,000
5  bhavani   17  10,000
6     usha   12  15,000

In [2]:
df

      Name  Age  Salary
0      jyo   16  10,000
1    jyosh   25  20,000
2  jyotsna   20  35,000
3    priya   21  25,000
4    satya   18  20,000
5  bhavani   17  10,000
6     usha   12  15,000

In [3]:
print(df.loc[4])

Name       satya
Age           18
Salary    20,000
Name: 4, dtype: object

In [4]:
print(df.loc[df["Age"]>20])

    Name  Age  Salary
1  jyosh   25  20,000
3  priya   21  25,000

In [5]:
df

      Name  Age  Salary
0      jyo   16  10,000
1    jyosh   25  20,000
2  jyotsna   20  35,000
3    priya   21  25,000
4    satya   18  20,000
5  bhavani   17  10,000
6     usha   12  15,000

In [6]:
df['address']=["a","b","c","d","e","f","g"]

In [7]:
df

      Name  Age  Salary address
0      jyo   16  10,000       a
1    jyosh   25  20,000       b
2  jyotsna   20  35,000       c
3    priya   21  25,000       d
4    satya   18  20,000       e
5  bhavani   17  10,000       f
6     usha   12  15,000       g

In [8]:
df["marks"]=0
df

      Name  Age  Salary address  marks
0      jyo   16  10,000       a      0
1    jyosh   25  20,000       b      0
2  jyotsna   20  35,000       c      0
3    priya   21  25,000       d      0
4    satya   18  20,000       e      0
5  bhavani   17  10,000       f      0
6     usha   12  15,000       g      0

In [9]:
df.loc[1]

Name        jyosh
Age            25
Salary     20,000
address         b
marks           0
Name: 1, dtype: object

In [10]:
df.loc[1,"Name"]

'jyosh'

In [18]:
df.head()

      Name  Age  Salary address  marks
0      jyo   16  10,000       a      0
1    jyosh   25  20,000       b      0
2  jyotsna   20  35,000       c      0
3    priya   21  25,000       d      0
4    satya   18  20,000       e      0

In [19]:
df.tail()

      Name  Age  Salary address  marks
2  jyotsna   20  35,000       c      0
3    priya   21  25,000       d      0
4    satya   18  20,000       e      0
5  bhavani   17  10,000       f      0
6     usha   12  15,000       g      0

In [20]:
df["Age"]>30

0    False
1    False
2    False
3    False
4    False
5    False
6    False
Name: Age, dtype: bool

In [21]:
df["Age"]

0    16
1    25
2    20
3    21
4    18
5    17
6    12
Name: Age, dtype: int64

In [23]:
df[["Name","Salary"]]

      Name  Salary
0      jyo  10,000
1    jyosh  20,000
2  jyotsna  35,000
3    priya  25,000
4    satya  20,000
5  bhavani  10,000
6     usha  15,000

In [24]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Name     7 non-null      object
 1   Age      7 non-null      int64
 2   Salary   7 non-null      object
 3   address  7 non-null      object
 4   marks    7 non-null      int64
dtypes: int64(2), object(3)
memory usage: 408.0+ bytes

In [25]:
df["Age"].max()

25

In [ ]:
df["Age"]